//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
//******************************************************************************
#include "meas50.h" // Включаем файл заголовка для нашего модуля
//******************************************************************************
// Секция определения переменных, используемых в модуле
//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные
//------------------------------------------------------------------------------
//char GlobalVar1;
//char GlobalVar2;
//...
//------------------------------------------------------------------------------
// Локальные
//------------------------------------------------------------------------------


//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************

//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)
//******************************************************************************
static void  hpf_1_init         (HPF1_t *C);
static float hpf_1              (HPF1_t *C, float In);

static void  bpf_2_init         (BPF2_t *C);
static float bpf_2              (BPF2_t *C, float In);

static void  lpf_2_1_init       (LPF2_t *C);
static void  lpf_2_2_init       (LPF2_t *C);


//******************************************************************************
//   Загрузка коэффициентов в структуры фильтров
//******************************************************************************
void meas_50Hz_filter_init (MEAS50_t *Ch, float Scale) {     
  hpf_1_init  (&Ch->Hpf1);
  bpf_2_init  (&Ch->Bpf2);
  lpf_2_1_init(&Ch->Lpf2_1);
  lpf_2_2_init(&Ch->Lpf2_2);
  Ch->Scale = Scale;
}

//******************************************************************************
//    Измерение амплитуды 50 Гц. На входе отсчеты АЦП, на выходе значение амплитуды без постоянного смещения
//******************************************************************************
/*
Вызываем функцию с частотой 8 кГц. 
Убираем постоянку с помощью ФВЧ.
Применяем полосовик на 50 Гц.
Квадратим
Применяем ФНЧ
Масштабируем (возможно в начало надо перенести)
*/
float meas_50Hz (MEAS50_t *Ch, uint16_t In){
float Tmp;

  Tmp = In;

  Tmp = hpf_1 (&Ch->Hpf1, (float)In);                                            // Убираем постоянку
  Tmp = bpf_2 (&Ch->Bpf2, Tmp);                                                  // Фильтруем 50 +/-5Гц
  Tmp = fabs(Tmp);
  Tmp = lpf_2 (&Ch->Lpf2_1, Tmp);                                                // ФНЧ 4 порядка
  Tmp = lpf_2 (&Ch->Lpf2_2, Tmp);
  
  Tmp *= Ch->Scale;
  
  return Tmp;  
}








//---   HPF_1   ----------------------------------------------------------------


static void hpf_1_init (HPF1_t *C){ // 5Hz, Fd=8kHz
  C->S1 = 0.999215218041547;
  C->A2 = -0.99843043608309412;
}

static float hpf_1 (HPF1_t *C, float In){
float Tmp;
  
  Tmp = (In * C->S1) - (C->Prev1 * C->A2); 
  C->Out = Tmp - C->Prev1;  
  C->Prev1 = Tmp;  
  return C->Out;
}



//---   BPF_2   ----------------------------------------------------------------
static void bpf_2_init (BPF2_t *C){ // 45-55Hz, Fd=8kHz
  C->S1 = 0.003911649911245838;
  C->A2 = -1.9906561533298168;
  C->A3 = 0.99217670017750836;
}


static float bpf_2 (BPF2_t *C, float In){
float Tmp;
  
  Tmp = (In * C->S1) - (C->Prev1 * C->A2) - (C->Prev2 * C->A3);  
  C->Out = Tmp - (C->Prev2);
  C->Prev2 = C->Prev1;
  C->Prev1 = Tmp;
  return C->Out;
}


//---   LPF_2   ----------------------------------------------------------------
static void lpf_2_1_init (LPF2_t *C){ // 6Hz, Fd=8kHz
  C->S1 = 5.5416486891528805e-06;
  C->A2 = -1.9963776327839544;
  C->A3 = 0.99639979937871082;
  C->B2 = 2;
}

static void lpf_2_2_init (LPF2_t *C){ // 6Hz, Fd=8kHz
  C->S1 = 5.5275769911807021e-06;
  C->A2 = -1.9913083069095199;
  C->A3 = 0.99133041721748427;
  C->B2 = 2;
}

float lpf_2 (LPF2_t *C, float In){
float Tmp;
  
  Tmp = (In * C->S1) - (C->Prev1 * C->A2) - (C->Prev2 * C->A3);
  C->Out = Tmp + (C->Prev1 * C->B2) + C->Prev2;
  C->Prev2 = C->Prev1;
  C->Prev1 = Tmp;
  return C->Out;
}








//******************************************************************************
// ENF OF FILE
//******************************************************************************