#ifndef _COM_CONTROL_H // Блокируем повторное включение этого модуля
#define _COM_CONTROL_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "stm32f4xx_hal.h"
#include "codec.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************
//typedef struct
//{
//...
//} T_STRUCT;
//typedef ...
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
extern REG_t R; 
extern SETTINGS_t S;
extern MEAS_t M;

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void BT_ParseCommand (char *Line);

//****************************************************************************** 
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************