#ifndef _DDS16_H // Блокируем повторное включение этого модуля
#define _DDS16_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include "stm32f4xx_hal.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//#define ...
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct {           
  uint32_t Freq;                                                                // Генерируемая частота
  uint32_t Fdiskr;                                                              // Частота с которой вызывается функция DDS
  uint32_t Phase;                                                               // Накопитель фазы для I
  uint32_t PhaseQ;                                                              // Накопитель фазы для генерации Q выхода
  float const *ptr;                                                             // указатель. Временная переменная.
  uint32_t temp;
  float I;                                                                      // Выход InPhase
  float Q;                                                                      // Выход Quadrature
}DDS16_t;


//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
extern const float  Sin_q16_table [16384];
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void dds16 (DDS16_t *D);
//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************