#ifndef _DISPLAY_H // Блокируем повторное включение этого модуля
#define _DISPLAY_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include "stm32f4xx_hal.h"
#include "ssd1306.h"
#include "main.h"

//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//#define ...
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef enum {
  SCREEN_MEAS_ALL_CURRENT,
  SCREEN_MEAS_ALL_VOLTAGE,
  SCREEN_MEAS_TEMP_0_1_2,
  SCREEN_CNT,
  SCREEN_MSG
}
SCREEN_e;
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
//extern char GlobalVar1;
//extern char GlobalVar2;
//extern ...
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void draw_td (SSD1306_COLOR Color);
//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************