/*!
\file
\brief Процедыры формирования и отправки POST запросов

Работа только с отправкой. Более низкоуровненвые задачи типа подключения к сети
в файле esp.h
*/
#ifndef _ESP_SEND_H // Блокируем повторное включение этого модуля
#define _ESP_SEND_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include <stdbool.h>
#include "stm32f4xx_hal.h"
#include "main.h"
#include "work.h"
#include "cmsis_os.h"
#include "string.h"

//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//#define ...
//******************************************************************************
// Секция определения типов
//******************************************************************************
//typedef struct
//{
//...
//} T_STRUCT;
//typedef ...
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
extern REG_t R;  
extern MEAS_t M;
extern SETTINGS_t S;

extern uint32_t        DevID_Dw0;                                               // Уникальный ID контроллера
extern uint32_t        DevID_Dw1;
extern uint32_t        DevID_Dw2;

extern char            TmpStr[128];
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void            get_DevID_from_server   (void);   
void            txt_freq_send           (void);           
void            txt_rare_send           (void);           
void            bin_rare_send           (void);         
//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************