#ifndef _NEW_MODULE_H // Блокируем повторное включение этого модуля
#define _NEW_MODULE_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include <stdbool.h>
#include "stm32f4xx_hal.h"
#include "dds16.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//#define ...
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef enum
{
  NARROW,
  MEDIUM,
  WIDE
} 
BW_t;


typedef struct
{
  //---   Work   ---------------------------------------------------------------
  float                 In;
  float                 Out;
  float                 Out_8k;
  
  
  //---   Settings   -----------------------------------------------------------
  DDS16_t               DDS_Carrier;
  BW_t                  BW;
  
  //---   Internal   -----------------------------------------------------------
  float                 Filter_30_I [30];
  float                 Filter_30_Q [30];
  uint16_t              Filter_30_idx;
  float                 Filter_128_I[128];
  float                 Filter_128_Q[128];
  uint16_t              Filter_128_idx;
  float                 Filter_128_bpf[128];
  uint16_t              Filter_128_bpf_idx;
} 
RXSSB_t;
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
//extern char GlobalVar1;
//extern char GlobalVar2;
//extern ...
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
bool rx_ssb (RXSSB_t *Ch);
//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************